Comment: Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Testcontainers Desktop.
Identifier: com.github.anywhereops.download.TestcontainersDesktop
Input:
  NAME: Testcontainers Desktop
MinimumVersion: '2.3'
Process:
- Arguments:
    appcast_url: https://get.testcontainers.cloud/download/client/stable/appcast.xml
  Processor: SparkleUpdateInfoProvider
- Arguments:
    filename: '%NAME%-%version%.dmg'
  Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    input_path: '%pathname%/Testcontainers Desktop.app'
    requirement: identifier "com.atomicjar.desktop" and anchor apple generic and certificate
      1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
      /* exists */ and certificate leaf[subject.OU] = "9BNSXJN65R"
  Processor: CodeSignatureVerifier
