Comment: Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Testcontainers Desktop and imports it
  into Munki.
Identifier: com.github.anywhereops.munki.TestcontainersDesktop
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: Testcontainers Desktop
  pkginfo:
    catalogs:
    - testing
    description: Grammar checker.
    developer: Docker Inc
    display_name: Testcontainers Desktop
    name: '%NAME%'
    unattended_install: true
MinimumVersion: '2.3'
ParentRecipe: com.github.anywhereops.download.TestcontainersDesktop
Process:
- Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
  Processor: MunkiImporter
